Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་མུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་མུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་མུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་མུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of words of boundlessness? They are the inconceivably numerous words of boundlessness concerning the composite, the inconceivably numerous words of boundlessness concerning teaching the composite, the inconceivably numerous words of boundlessness concerning the kleśas, and the inconceivably numerous words of boundlessness concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཞལ་དུ་མེད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of incomparability. What are the four kinds of words of incomparability?

source: འདུ་བྱེད་གཞལ་དུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་གཞལ་དུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་གཞལ་དུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་གཞལ་དུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of incomparability concerning the composite, the inconceivably numerous words of incomparability concerning teaching the composite, the inconceivably numerous words of incomparability concerning the kleśas, and the inconceivably numerous words of incomparability concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གྲངས་མེད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of innumerability. What are the four kinds of words of innumerability?

source: འདུ་བྱེད་གྲངས་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་གྲངས་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་གྲངས་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་གྲངས་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of innumerability concerning the composite, the inconceivably numerous words of innumerability concerning teaching the composite, the inconceivably numerous words of innumerability concerning the kleśas, and the inconceivably numerous words of innumerability concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དཔག་ཏུ་མེད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of unquantifiability. What are the four kinds of words of unquantifiability?

source: འདུ་བྱེད་དཔག་ཏུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་དཔག་ཏུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་དཔག་ཏུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་དཔག་ཏུ་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of unquantifiability concerning the composite, the inconceivably numerous words of unquantifiability concerning teaching the composite, the inconceivably numerous words of unquantifiability concerning the kleśas, and the inconceivably numerous words of unquantifiability concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚད་མེད་པའི་ཚིག་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of words of immeasurability. What are the four kinds of words of immeasurability?

source: འདུ་བྱེད་ཚད་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ཚད་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ཚད་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ཚད་མེད་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous words of immeasurability concerning the composite, the inconceivably numerous words of immeasurability concerning teaching the composite, the inconceivably numerous words of immeasurability concerning the kleśas, and the inconceivably numerous words of immeasurability concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པའི་ཚིག་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of words of wisdom.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཤེས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ཤེས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ཤེས་པའི་ཚིག་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of words of wisdom? They are the inconceivably numerous words of wisdom concerning the composite, the inconceivably numerous words of wisdom concerning teaching the composite, the inconceivably numerous words of wisdom concerning the kleśas, and the inconceivably numerous words of wisdom concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པ་བསགས་པ་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of accumulation of wisdom.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་ཤེས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ཤེས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ཤེས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of accumulation of wisdom? They are the inconceivably numerous accumulations of wisdom concerning the composite, the inconceivably numerous accumulations of wisdom concerning teaching the composite, the inconceivably numerous accumulations of wisdom concerning the kleśas, and the inconceivably numerous accumulations of wisdom concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་པའི་རིགས་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: Those are the four. “Young man, the bodhisattvas have four kinds of families of wisdom. What are the four kinds of families of wisdom?

source: འདུ་བྱེད་ཀྱི་ཤེས་པའི་རིགས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ཤེས་པའི་རིགས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པའི་རིགས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ཤེས་པའི་རིགས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous families of wisdom concerning the composite, the inconceivably numerous families of wisdom concerning teaching the composite, the inconceivably numerous families of wisdom concerning the kleśas, and the inconceivably numerous families of wisdom concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་བསགས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of accumulation of eloquence. What are the four kinds of accumulation of eloquence?

source: འདུ་བྱེད་ཀྱི་སྤོབས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྤོབས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་སྤོབས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། རྣམ་པར་བྱང་བའི་སྤོབས་པ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous accumulations of eloquence concerning the composite, the inconceivably numerous accumulations of eloquence concerning teaching the composite, the inconceivably numerous accumulations of eloquence concerning the kleśas, and the inconceivably numerous accumulations of eloquence concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མདོ་སྡེ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of sūtras.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་མདོ་སྡེ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་མདོ་སྡེ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་མདོ་སྡེ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་མདོ་སྡེ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of sūtras? They are the inconceivably numerous sūtras concerning the composite, the inconceivably numerous sūtras concerning teaching the composite, the inconceivably numerous sūtras concerning the kleśas, and the inconceivably numerous sūtras concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མདོ་སྡེ་བསགས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: Those are the four. “Young man, the bodhisattvas have four kinds of accumulations of sūtras. What are the four kinds of accumulations of sūtras?

source: །འདུ་བྱེད་ཀྱི་མདོ་སྡེ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་མདོ་སྡེ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་མདོ་སྡེ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། རྣམ་པར་བྱང་བའི་མདོ་སྡེ་བསགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous accumulations of sūtras concerning the composite, the inconceivably numerous accumulations of sūtras concerning teaching the composite, the inconceivably numerous accumulations of sūtras concerning the kleśas, and the inconceivably numerous accumulations of sūtras concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མང་དུ་ཐོས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of great learning. What are the four kinds of great learning?

source: འདུ་བྱེད་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་མང་དུ་ཐོས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of great learning concerning the composite, the inconceivably numerous kinds of great learning concerning teaching the composite, the inconceivably numerous kinds of great learning concerning the kleśas, and the inconceivably numerous kinds of great learning concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནོར་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of wealth.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་ནོར་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ནོར་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ནོར་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ནོར་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of wealth? They are the inconceivably numerous kinds of wealth concerning the composite, the inconceivably numerous kinds of wealth concerning teaching the composite, the inconceivably numerous kinds of wealth concerning the kleśas, and the inconceivably numerous kinds of wealth concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསླབ་པ་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of training.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་བསླབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་བསླབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་བསླབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་བསླབ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of training? They are the inconceivably numerous kinds of training concerning the composite, the inconceivably numerous kinds of training concerning teaching the composite, the inconceivably numerous kinds of training concerning the kleśas, and the inconceivably numerous kinds of training concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of fields of conduct.

source: བཞི་གང་ཞེ་ན། འདུ་བྱེད་ཀྱི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: What are the four kinds of fields of conduct? They are the inconceivably numerous fields of conduct concerning the composite, the inconceivably numerous fields of conduct concerning teaching the composite, the inconceivably numerous fields of conduct concerning the kleśas, and the inconceivably numerous fields of conduct concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལས་བཞི་སྟེ།
en: Those are the four. “Young man, the bodhisattvas have four kinds of action.

source: འདུ་བྱེད་ཀྱི་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ལས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of action concerning the composite, the inconceivably numerous kinds of action concerning teaching the composite, the inconceivably numerous kinds of action concerning the kleśas, and the inconceivably numerous kinds of action concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤོབས་པ་བཞི་སྟེ།
en: “Young man, the bodhisattvas have four kinds of eloquence.

source: འདུ་བྱེད་ཀྱི་སྤོབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྤོབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་སྤོབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྤོབས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of eloquence concerning the composite, the inconceivably numerous kinds of eloquence concerning teaching the composite, the inconceivably numerous kinds of eloquence concerning the kleśas, and the inconceivably numerous kinds of eloquence concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་བསྒོམ་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of meditation on the path. What are the four kinds of meditation on the path?

source: འདུ་བྱེད་ཀྱི་ལམ་བསྒོམ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ལམ་བསྒོམ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ལམ་བསྒོམ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ལམ་བསྒོམ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of meditation on the path concerning the composite, the inconceivably numerous kinds of meditation on the path concerning teaching the composite, the inconceivably numerous kinds of meditation on the path concerning the kleśas, and the inconceivably numerous kinds of meditation on the path concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པའི་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of the kleśas. What are the four kinds of knowledge of the kleśas?

source: འདུ་བྱེད་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པ་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པ་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བ་ཀུན་ནས་ཉོན་མོངས་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of the kleśas concerning the composite, the inconceivably numerous kinds of knowledge of the kleśas concerning teaching the composite, the inconceivably numerous kinds of knowledge of the kleśas concerning the kleśas, and the inconceivably numerous kinds of knowledge of the kleśas concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འབྲས་བུ་ཡོད་པའི་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of the result. What are the four kinds of knowledge of the result?

source: འདུ་བྱེད་ཀྱི་འབྲས་བུ་ཡོད་པའི་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་འབྲས་བུ་ཡོད་པའི་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ཀུན་ནས་ཉོན་མོངས་པའི་འབྲས་བུ་ཡོད་པའི་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་འབྲས་བུ་ཡོད་པའི་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of the result concerning the composite, the inconceivably numerous kinds of knowledge of the result concerning teaching the composite, the inconceivably numerous kinds of knowledge of the result concerning the kleśas, and the inconceivably numerous kinds of knowledge of the result concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མ་རིག་པ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of ignorance. What are the four kinds of knowledge of ignorance?

source: འདུ་བྱེད་ཀྱི་མ་རིག་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་མ་རིག་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་མ་རིག་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་མ་རིག་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of ignorance concerning the composite, the inconceivably numerous kinds of knowledge of ignorance concerning teaching the composite, the inconceivably numerous kinds of knowledge of ignorance concerning the kleśas, and the inconceivably numerous kinds of knowledge of ignorance concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྡུག་བསྔལ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of suffering. What are the four kinds of knowledge of suffering?

source: འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྡུག་བསྔལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་སྡུག་བསྔལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྡུག་བསྔལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of suffering concerning the composite, the inconceivably numerous kinds of knowledge of suffering concerning teaching the composite, the inconceivably numerous kinds of knowledge of suffering concerning the kleśas, and the inconceivably numerous kinds of knowledge of suffering concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡིད་མི་བདེ་བ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of unhappiness. What are the four kinds of knowledge of unhappiness?

source: འདུ་བྱེད་ཀྱི་ཡིད་མི་བདེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ཡིད་མི་བདེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ཡིད་མི་བདེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ཡིད་མི་བདེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of unhappiness concerning the composite, the inconceivably numerous kinds of knowledge of unhappiness concerning teaching the composite, the inconceivably numerous kinds of knowledge of unhappiness concerning the kleśas, and the inconceivably numerous kinds of knowledge of unhappiness concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབུལ་པོ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of poverty. What are the four kinds of knowledge of poverty?

source: འདུ་བྱེད་ཀྱི་དབུལ་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་དབུལ་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་དབུལ་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་དབུལ་པོ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of poverty concerning the composite, the inconceivably numerous kinds of knowledge of poverty concerning teaching the composite, the inconceivably numerous kinds of knowledge of poverty concerning the kleśas, and the inconceivably numerous kinds of knowledge of poverty concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱེ་བ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of birth. What are the four kinds of knowledge of birth?

source: འདུ་བྱེད་ཀྱི་སྐྱེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྐྱེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་སྐྱེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྐྱེ་བ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of birth concerning the composite, the inconceivably numerous kinds of knowledge of birth concerning teaching the composite, the inconceivably numerous kinds of knowledge of birth concerning the kleśas, and the inconceivably numerous kinds of knowledge of birth concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནང་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of inner knowledge. What are the four kinds of inner knowledge?

source: འདུ་བྱེད་ཀྱི་ནང་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ནང་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ནང་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ནང་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of inner knowledge concerning the composite, the inconceivably numerous kinds of inner knowledge concerning teaching the composite, the inconceivably numerous kinds of inner knowledge concerning the kleśas, and the inconceivably numerous kinds of inner knowledge concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱི་རོལ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of external knowledge. What are the four kinds of external knowledge?

source: འདུ་བྱེད་ཀྱི་ཕྱི་རོལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ཕྱི་རོལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ཕྱི་རོལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ཕྱི་རོལ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of external knowledge concerning the composite, the inconceivably numerous kinds of external knowledge concerning teaching the composite, the inconceivably numerous kinds of external knowledge concerning the kleśas, and the inconceivably numerous kinds of external knowledge concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ངོ་ཚ་ཤེས་པའི་ཡེ་ཤེས་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of modesty. What are the four kinds of knowledge of modesty?

source: འདུ་བྱེད་ཀྱི་ངོ་ཚ་ཤེས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་ངོ་ཚ་ཤེས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ངོ་ཚ་ཤེས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་ངོ་ཚ་ཤེས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of modesty concerning the composite, the inconceivably numerous kinds of knowledge of modesty concerning teaching the composite, the inconceivably numerous kinds of knowledge of modesty concerning the kleśas, and the inconceivably numerous kinds of knowledge of modesty concerning purification.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: Those are the four. “Young man, the bodhisattvas have four kinds of knowledge of truth. What are the four kinds of knowledge of truth?

source: འདུ་བྱེད་ཀྱི་བདེན་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་བདེན་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་བདེན་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་བདེན་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of truth concerning the composite, the inconceivably numerous kinds of knowledge of truth concerning teaching the composite, the inconceivably numerous kinds of knowledge of truth concerning the kleśas, and the inconceivably numerous kinds of knowledge of truth concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྲིད་པ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of existence. What are the four kinds of knowledge of existence?

source: འདུ་བྱེད་ཀྱི་སྲིད་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདུ་བྱེད་ཡོངས་སུ་བཤད་པའི་སྲིད་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་སྲིད་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་རྣམ་པར་བྱང་བའི་སྲིད་པ་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་འདི་བཞིའོ།
en: They are the inconceivably numerous kinds of knowledge of existence concerning the composite, the inconceivably numerous kinds of knowledge of existence concerning teaching the composite, the inconceivably numerous kinds of knowledge of existence concerning the kleśas, and the inconceivably numerous kinds of knowledge of existence concerning purification. Those are the four.

source: །གཞོན་ནུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དངོས་པོ་ཤེས་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “Young man, the bodhisattvas have four kinds of knowledge of existents. What are the four kinds of knowledge of existents?
